/* Project:		GSMWin
   File Name:	System.h
   Author:		刘芳
   Date:		
   Purpose:		系统管理器
*/

#ifndef _System
#define _System

#include <Windows.h>
#include <stdio.h>
enum TYPE
{
	// 游戏对象类型列表
	TYPE_SHIP = 0,	//对象类型为飞船
	TYPE_BULLET,	//对象类型为子弹
	TYPE_ENEMY,	//对象类型为敌军
	TYPE_SKill,	//对象类型为导弹
	TYPE_ENYME_BULLET,//对象类型为敌人子弹
	TYPE_BOSS1,		//BOSS1
	TYPE_BOSS2,		//BOSS2
	TYPE_BG1,
	TYPE_NUM
};
//------------------------------------------------------------------------------
// Typedef:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Consts:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Structures:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Variables:
//------------------------------------------------------------------------------
FILE *fp;   // Output.txt

//------------------------------------------------------------------------------
// Public Functions:
//------------------------------------------------------------------------------

// 系统初始化
extern int System_Initialize(HINSTANCE hInstance, int nCmdShow);

// 系统退出
extern void System_Exit(void);

#endif